old crap/app/controllers/principal_controller.rb

SELECT `contribuyente`.* FROM `contribuyente` WHERE `contribuyente`.`id` = 1 LIMIT 1
SELECT `usuario`.* FROM `usuario` WHERE `usuario`.`cedula` = '20174430' LIMIT 1
---
  def contribuyentes
    @relacion = ContribuyenteAuxiliar.find(:all, :select => "contribuyente_auxiliar.*")
    @contribuyente = Contribuyente.find(:all,
            :joins => "INNER JOIN contribuyente_auxiliar ON contribuyente_auxiliar.contribuyente_id = contribuyente.id" ,
            :select => "contribuyente.*")
    @auxiliar = Usuario.find(:all,
            :joins => "INNER JOIN contribuyente_auxiliar ON contribuyente_auxiliar.auxiliar_cedula = usuario.cedula" ,
            :select => "usuario.*")